Revit 2027 API
BuiltInFailures.FamilyFailures.CouldNotGenerateReferencesForFamilyInstance Property
 Could not generate references for Family Instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotGenerateReferencesForFamilyInstance { get; }
Public Shared ReadOnly Property CouldNotGenerateReferencesForFamilyInstance As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotGenerateReferencesForFamilyInstance {
	FailureDefinitionId^ get ();
}
static member CouldNotGenerateReferencesForFamilyInstance : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace